{
    "contact information": [
      {
        "name": "Simon Italia",
        "phone":"+16463790039",
        "email":"simonitalia@gmail.com"
      }
    ],

    "profile": [
      {
        "profession":"iOS / Swift Developer, Web Systems Product Director, Snr. Project Manager & Bus. Analyst",
        "general": "A very experienced, exceptionally skilled and accomplished software development professional, successfully holding positions as Product Manager / Director, Program Manager, Senior Project Manager and Business Analyst over 15+ years, specializing in sophisticated web and mobile platforms across the Beauty, Finance, and Online Advertising industries. I’m recently also a self taught iOS (Swift) Engineer with a keen interest in ML (Machine Learning), AI (Artificial Intelligence) and AR (Augmented Reality), with an extensive range of self written apps and algorithms completed.",
        "value proposition": "After many fruitful and wonderful years leading, managing and mentoring teams across a myriad of high profile, large web & mobile app development projects, from concept through to production, I have made the very challenging transition to iOS Engineer and will therefore be a strong asset to any organization looking to add an exceptional, seasoned software development professional to their iOS team. Whether it be for delivery of new features to a preexisting feature set, or delivery of a new, MVP application."
      }
    ],

    "websites": [
      {
        "linkedin": "www.linkedin.com/in/simonitalia/",
        "github": "www.github.com/simonitalia",
        "business website": "www.magicaltomato.com"
      }
    ],

    "personal projects": [
        {
          "project name": "7 Marbles",
          "date": "October, 2019",
          "github": "https://github.com/simonitalia/SevenMarbles",
          "description": "The aim of the game is to place and rest each of the 7 marbles in the middle of each of the seven circles of the playing area. The marbles are moved by tilting the device to move the marbles (using CoreMotion framework), and have physics so they respond to gravity and react to collisions like in the real world. Sound is also made when marbles collide with each other and / or the the playing area wall",
          "technologies": "SpriteKit, GameplayKit, CoreMotion, CMMotionManager, SKSpriteNode, SKShapeNode, SKPhysicsWorld, SKPhysicsBody, CategoryBitMask, ContactTestBitMask, ContactBody, SKPhyscisConatct, SKAction, UIBezierPath, CGRect, enum, SKView, extension (UIView)"
        },

        {
          "project name": "Waiter's Friend",
          "date": "October, 2019",
          "github": "https://github.com/simonitalia/WaitersFriend",
          "description": "The aim of this app is to find how to make any cocktail. The app connects to a paid tier (patreon) 3rd party cocktail database, and utilizes JSON-API calls to fetch data on demand to populate the respective screens of the app. The also caches data to save on API calls, and saves data (as JSON data) to the app bundle (userDefaults) when a user saves cocktails to their favorites",
          "technologies": "UIKit, CGAffineTransform, UIActivityIndicator, UICollectionView, UICollectionViewCompositionalLayout, UITableView, GestureRecognizer, SegmentController, .xib, JSON-APIs, JSON Encoder / Decoder, URLComponents, queryItems, appendingPathComponents, @escaping functions, UserDefaults, enum, extension (UIView), UITableViewCell, UIActivityIndicator, UISearchController, UIAlertController"
        },

        {
          "project name": "Random Number Set Generator Algorithms",
          "date": "August, 2019",
          "github": "private repository",
          "description": "Random number set generator combination sets using rules derived from statistical analysis / research to influence the sets of numbers generated",
          "technologies": "Swift Playgrounds"
        },

        {
          "project name": "Simon Italia Resume",
          "date": "December, 2019",
          "github": "https://github.com/simonitalia/simonitaliaresume",
          "description": "My Resume / CV Represented as an iOS App",
          "technologies": "UIKit, UIImageView, UITabController, UINavigationController, CGAffineTransform"
        }
    ],

    "coursework projects": [
        {
          "project name": "SwiftAlgorithmCodingChallenges",
          "date": "September, 2019",
          "github": "https://github.com/simonitalia/SwiftAlgorithmCodingChallenges",
          "description": "My solutions to over 40 swift coding challenges listed in the book Swift Coding Challenges, by Paul Hudson",
          "technologies": "String algorithms, Number algorithms (int, double, float, binary), Files / FileManager algorithms, Linked Lists algorithms"
        },

        {
          "project name": "Trade My Tesla",
          "date": "June, 2019",
          "github": "https://github.com/simonitalia/TradeMyTesla",
          "description": "This app uses historical Tesla sale data combined with Swift's ML framework to determine the resale value of a Tesla.",
          "technologies": "UIKit, CoreML, UIStackView, Python, MLModel, UISegmentController"
        },

        {
          "project name": "iBeacon",
          "date": "February, 2019",
          "github": "https://github.com/simonitalia/iBeacon",
          "description": "A location aware app. When a user comes in range of an iBeacon, trigger a message.",
          "technologies": "CLLocationManager, CLBeaconRegion, CLProximity, NSLocationAlwaysUsageDescription, NSLocationWhenInUseUsageDescription"
        },

        {
          "project name": "My Restaurant",
          "date": "September, 2019",
          "github": "https://github.com/simonitalia/MyRestaurant",
          "description": "The aim of this app is develop a Restaurant menu customers can review and select items from, add to an order, and then submit the order. Menu / Category Data is provided in locally (computer) hosted JSON files, and order submission uses POST methods.",
          "technologies": "UIKit, UITabBarController, UINavigationController, struct (Data Models), UITableView, JSON-APIs, JSON Encoder / Decoder, URLComponents, queryItems, appendingPathComponents, @escaping functions, UserDefaults, enum, UIAlertController"
        },

        {
          "project name": "To Do List",
          "date": "June 2018 (v1.0), January 2019 (v2.0)",
          "github": "https://github.com/simonitalia/ToDoList",
          "description": "The aim of this app is to allow users to create a To Do List where they can: Add a new to do item, edit existing to do item, delete a to do item, mark to do item as complete, add more details like due date and notes, search to do items by title.",
          "technologies": "UIKit, FileManager, UITableViewController, UINavigationController, DateFormatter, Class (Data Model), UISearchController, UITableViewCell"
        },

        {
          "project name": "Bang",
          "date": "February, 2019",
          "github": "https://github.com/simonitalia/Bang",
          "description": "The aim of this game is to score as many points as possible before the timer runs out. To score points shoot the bad character (Yosemite Sam). Score bonus points by shooting the Money bag when it appears. Lose points by shooting the good character (Donald Duck). Be sure to reload gun before it is emptied. The gun holds a maximum of 6 shots. Reload at any time.",
          "technologies": "SpriteKit, GamePlayKit, GameScene, SKSpriteKitNode, SKAction, SKEmitterNode, UIBezierPath, CGPoint, UIAlertController, UIAlertAction, didSet, switch"
        },

        {
          "project name": "Notes",
          "date": "December, 2018",
          "github": "https://github.com/simonitalia/ShoppingList",
          "description": "The aim of this app is to create a simple shopping list, by adding and removing items to a UITableView, ensuring the entries are saved to the app's bundle for later retrieval when the app is closed, then reopened.",
          "technologies": "UICollectionViewController, UICollectionView, UICollectionViewCell, FileManager, UserDefaults"
        },

        {
          "project name": "Bull's Eye",
          "date": "April, 2018",
          "github": "https://github.com/simonitalia/BullsEye",
          "description": "The aim of this game is to drag the slider left or right and place it in a position that matches the random number you're given at the start of each round of the game.",
          "technologies": "UIKit, UIAlertController, UIWebView, html, UISliderView, Notifications, UIImageView, UIButtonView"
        },

        {
          "project name": "AR Sight Spotter",
          "date": "July, 2019",
          "github": "https://github.com/simonitalia/ARSightSpotter",
          "description": "The objective of this app is to overlay (augment) the real world with information (text) about what's around the user. The app works by using the iPhone camera to display the real world, the CoreLocation framework to figure out where in the world the user is, the wikipedia API to download data of based on the user's location, and the ARKit framework to overlay the additional, virtual data (node objects).",
          "technologies": "ARKit, CoreLocation, SceneKit, SKScene, SpriteKit, SKLabelNode, CLLocationManager, CLLocation, simd_float4x4, SCNMatrix4MakeRotation, ARAnchor, JSON-API"
        }
    ],

    "professional experience": [
        {
          "job title": "iOS App Development Project Manager",
          "description": "Responsible for leading the engineering team to deliver and launch the company’s iOS (Beta) application.",
          "company": "Airstayz",
          "company description": "Airtstayz is a travel booking platform with a focus on digital, keyless hotel entry as well as rewarding loyal customers with digital currency / token, called STAY.",
          "company website": "airstayz.com",
          "location": "Melbourne, Australia",
          "period": "Jul 2018 to Dec 2018",
          "duration": "6 months",
          "accomplishments": "Integrated app with a digital coin wallet for customer’s to store digital currency(ies) of choice, Integrated app with Airstayz booking platform, enabling customer account management and hotel booking capabilities, Designed and implemented the company’s JIRA workflow management process."
        },

        {
          "job title": "EMEA Market E-Commerce Platform / Web Applications Product Director",
          "description": "A European Markets focused position, with roles covering Product Management, Project Management and BA leadership and oversight of large scale IT projects for Estee Lauder’s in house E-Commerce platform.",
          "company": "Estee Lauder Companies Online (An Estee Lauder Company)",
          "company description": "Estee Lauder Companies is a global leader in the Beauty Industry, with online / E-Commerce sales exceeding $1BN annually.",
          "company website": "https://www.elcompanies.com/",
          "location": "London, UK",
          "period": "Apr 2017 to Apr 2018",
          "duration": "1 year",
          "accomplishments": "Payment system upgrade/migration from Global Collect to Ingenico for the EMEA market. Migration required major changes to the website’s front end/UI, API/Web services, database and fulfillment/Warehouse systems, Loyalty program functionality designed, developed and rolled out to key markets in Europe"
        },

        {
          "job title": "Global E-Commerce Platform / Web Applications Product Director",
          "description": "A US and Global markets focused position with roles covering Product Management, Project Management and BA leadership on large scale projects for Estee Lauder’s E-Comm platform. Mar 2011 to Apr 2017",
          "company": "Estee Lauder Companies Online (An Estee Lauder Company)",
          "company description": "Estee Lauder Companies is a global leader in the Beauty Industry, with online / E-Commerce sales exceeding $1BN annually.",
          "company website": "",
          "location": "New York City, USA",
          "period": "Mar 2011 to Apr 2017",
          "duration": "6 years",
          "accomplishments": "E-Commerce / Omni-channel Loyalty program: Lead the development and integration of the company’s first truly integrated multi-channel Loyalty Program (Web, Mobile iOS app + POS/In-store) in the US and Canada markets, E-Commerce Checkout redesign: Lead the research, design and implementation of the new 1-page checkout interface, flows and technological architecture on Estee’s Global online platform, Social Login integration with Facebook."
        },

        {
          "job title": "Equities & Funds Research Web Platform Project Manager / Scrum Master",
          "description": "Project Management for the delivery of the new, v2.0 Equities Research platforms MSA & FMR, and subsequent features",
          "company": "Standard & Poor's Global (Market Intelligence), A McGraw-Hill Company",
          "company description": "Dedicated to providing clients with timely, objective, and actionable investment intelligence, Standard & Poor’s Equity Research Services delivers a broad range of strategies and recommendations which enables clients to navigate and seek success in even the most complex global markets",
          "company website": "https://www.spglobal.com/marketintelligence",
          "location": "New York City, USA",
          "period": "Oct 2008 to Feb 2011",
          "duration": "2+ years",
          "accomplishments": "Lead the project team to deliver the next generation equity research platform, Market Scope Adviser (MSA), Lead a secondary project team to deliver the next generation Fund Management Research (FMR) platform."
        },

        {
          "job title": "Program Manager / Senior Project Manager",
          "description": "A senior role requiring strong Project leadership of cross-functional teams for the timely delivery of web software development projects. Project responsibilities included authoring & maintenance of project scope, schedules/milestones, risks & issues identification and mitigation strategies. Agile with SCRUM exercised on all projects. Regular status meetings with Stakeholders and product reviews with Product Owners to continually monitor and update product backlog. In this position I also managed and mentored direct reports from the PM, BA & QA / Test teams.",
          "company": "Fairfax Digital, (A Fairfax Media Business)",
          "company description": "Fairfax Digital is Australia's leading provider of online news and classifieds. Comprising around 30 interactive sites which reach over eight million visitors each month.",
          "company website": "https://www.fairfaxmedia.com.au",
          "location": "Melbourne, Australia",
          "period": "Jun 2006 to Oct 2008",
          "duration": "2+ years",
          "accomplishments": "Lead delivery of a technically complex project to display Premium, Executive job ads made for the company's print newspapers to online, Lead delivery of a new Classifieds website for Executive (100K+) job listings, Lead delivery of Premium product offering (Multi industry category listing and auto refresh)"
        },

        {
          "job title": "Senior Business Analyst",
          "description": "A senior role requiring strong Project & BA leadership of cross-functional teams for the timely delivery of web software development projects. Project responsibilities included authoring & maintenance of project scope, schedules/milestones, requirements, user interface and business rules, risks & issues identification and mitigation strategies. Agile with SCRUM exercised on all projects. In this position I also managed and mentored direct reports from the BA & QA / Test teams.",
          "company": "Fairfax Digital, (A Fairfax Media Business)",
          "company description": "Fairfax Digital is Australia's leading provider of online news and classifieds. Comprising around 30 interactive sites which reach over eight million visitors each month",
          "company website": "https://www.fairfaxmedia.com.au",
          "location": "Melbourne, Australia",
          "period": "Oct 2005 to Jun 2006",
          "duration": "9 months",
          "accomplishments": "Lead delivery of Premium product offering (Priority ad placement in search results), Lead the Taxonomy review & implementation project (updated industry and sub-industry categories)"
        },

        {
          "job title": "E-Commerce Solutions & Operations Manager",
          "description": "Management and execution of web-based software projects for the Business Travel industry. This position required strong project team leadership and stakeholder interaction skills to identify client requirements and translate discovered requirements into specifications for the Company's technology vendors. In this position I managed and mentored 6 reports, and presented our Technology solutions to potential clients.",
          "company": "Hogg Robinson Group",
          "company description": "HRG is a major, global provider of Business Travel, offering clients technological solutions for managing employees travel needs.",
          "company website": "https://au.hrgworldwide.com",
          "location": "Melbourne, Australia",
          "period": "Jan 2003 to Sep 2005",
          "duration": "2+ years",
          "accomplishments": "Lead delivery of a new web system for clients to view the company's travel and expenditure reports, Lead delivery of a new web based travel authorization system for corporate travelers"
        }
      ],

    "developer experience": [
      {
        "language": "Swift programming language",
        "location": "Remote (Melbourne, New York City, Europe, Asia)",
        "period": "Oct 2019 to current",
        "duration": "0.25 years",
        "description": "60+ iOS apps using Apple’s broad and powerful range of frameworks such as UIKit, SpriteKit, SceneKit, CoreML / CreateML, CoreMotion, WatchKit, CoreGraphics, NotificationCenter, Delegate Protocol Pattern, Notifications and Observers, MVC, Extensions, UITableViewController, UICollectionViewController, Encodable/Decodable Protocols, JSON Encoder/Decoder, CoreData",
        "projects": "https://github.com/simonitalia"
      }
    ],

    "experience overview": [
      {
        "job type": "iOS Swift Developer",
        "years experience": "0.25 year"
      },
        
      {
        "job type": "Web Systems Product Director",
        "years experience": "10+ years"
      },

      {
        "job type": "Web Systems Senior Project Manager",
        "years experience": "15+ years"
      },
      
      {
        "job type": "Web Systems Senior Business Analyst",
        "years experience": "15+ years"
      },

      {
        "job type": "Agile Scrum Master",
        "years experience": "15+ years"
      }
    ],

    "skills": [
        "Strong communication skills",
        "Influencing / negotiation skills",
        "Stakeholder Management (Project teams & Senior Executive)",
        "Deep knowledge of SDLC / full Project life-cycle",
        "Agile SDLC with Scrum",
        "Business process flows / mapping",
        "Requirements gathering",
        "Authoring functional specifications, UI / wireframes",
        "Usability testing & analysis",
        "Understanding web technologies (HTML, XML, CSS, JS, AJAX, DNS, MS-SQL",
        "Web Services (JSON, RESTful)",
        "Data ETL (Extract,Transform, Load) experience",
        "Staff mentoring & management",
        "PM / Issue management tools (Clarizen, Jira, Confluence, Bugzilla)",
        "Content Management (CMS) tools (Drupal, Sitecore)",
        "iOS / Swift (Xcode, Version Control - Git/Github, Object Oriented Programming (OOP), Xcode Instruments, Debugging, JSON-API)"
    ],

    "education": [
        {
          "school": "University of Helsinki",
          "course": "Elements of AI (Artificial Intelligence​)",
          "location": "Online",
          "period": " May 2018 - Jun 2019",
          "graduation year": "2019"
        },

        {
          "school": "RMIT University",
          "course": "Masters, Business Information Technology",
          "location": "Melbourne, Australia",
          "period": "Feb 2005 - Jun 2006",
          "graduation year": "3 subjects completed"
        },

        {
          "school": "Deakin University.",
          "course": "Graduate Diploma, Accounting & Finance",
          "location": "Melbourne, Australia",
          "period": "Feb 2000 - Nov 2002",
          "graduation year": "2002"
        },

        {
          "school": "Victoria University",
          "course": "Bachelor of Business (Administration & Management)",
          "location": "Melbourne, Australia",
          "period": "Feb 1992 - Jun 1996",
          "graduation year": "1996"
        }
    ],

    "industry certifications": [
        {
          "certification": "SCRUM Master Certification​ – Agile Software Development",
          "location": "Melbourne, Australia",
          "attainment year": "2007"
        },

        {
          "certification": "PRINCE 2​ ​Practitioner Certification​ and PRINCE 2 Foundation Certification",
          "location": "Melbourne, Australia",
          "attainment year": "2007"
        },

        {
          "certification": "Targeted Selection Interview Certification​ (Behavioral based interviewing)",
          "location": "Melbourne, Australia",
          "attainment year": "2006"
        }
    ],

    "swift project based courses": [
        {
          "provider": "Paul Hudson",
          "course": "Swift Coding Challenges",
          "location": "iBooks",
          "projects completed": "40+ algorithms",
          "period": "Aug 2019 - Sep 2019",
          "duration": "1 month",
          "completion year": "2019"
        },

        {
          "provider": "Paul Hudson",
          "course": "Advanced iOS - Volume 2",
          "location": "iBooks",
          "projects completed": "3 apps",
          "period": "Jul 2019 - Aug 2019",
          "duration": "1 month",
          "completion year": "2019"
        },

        {
          "provider": "Apple Education",
          "course": "App Development with Swift",
          "location": "iBooks",
          "projects completed": "3 apps",
          "period": "Jun 2019 - Jul 2019",
          "duration": "1 month",
          "completion year": "2019"
        },

        {
          "provider": "hackingwithswift.com",
          "course": "Hacking with Swift, by Paul Hudson",
          "location": "Online",
          "projects completed": "40+ apps",
          "period": "Jan 2019 - Jun 2019",
          "duration": "6 months",
          "completion year": "2019"
        },

        {
          "provider": "codewithchris.com",
          "course": "Fundamentals of iOS App Development with Swift",
          "location": "Online",
          "projects completed": "5 apps",
          "period": "Nov 2018 - Jan 2019",
          "duration": "3 months",
          "completion year": "2019"
        },

        {
          "provider": "raywenderlich.com",
          "course": "iOS and Swift for Beginners",
          "location": "Online",
          "projects completed": "2 apps",
          "period": "Apr 2018 - May 2018",
          "duration": "2 months",
          "completion year": "2018"
        }
    ],

    "swift foundational courses": [
        {
          "provider": "Udemy.com",
          "course": "Mastering ARKit from Scratch",
          "location": "Online",
          "period": "Oct 2018 - Nov 2018",
          "duration": "1 month",
          "completion year": "2019"
        },

        {
          "provider": "raywenderlich.com",
          "course": "Programming in Swift",
          "location": "Online",
          "period": "May 2018 - Jun 2018",
          "duration": "2 months",
          "completion year": "2018"
        },

        {
          "provider": "Udemy.com",
          "course": "Swift for Beginners",
          "location": "Online",
          "period": "Apr 2018 - Apr 2018",
          "duration": "2 weeks",
          "completion year": "2018"
        },

        {
          "provider": "Udemy.com",
          "course": "Intro to Swift for non-programmers",
          "location": "Online",
          "period": "Mar 2018 - Mar 2018",
          "duration": "2 weeks",
          "completion year": "2018"
        }
    ],

    "other certifications": [
      {
        "provider": "Bali Barista Center",
        "certification": "Barista Training & Certification",
        "location": "Bali, Indonesia",
        "attainment year": "2019"
      }
    ],

    "hobbies": [
      "Developing personal iOS Apps and Algorithms",
      "Learning the latest Swift frameworks",
      "Open Source IoT / Home Automation platforms",
      "The Python programming language",
      "Researching Machine Learning Technologies and Frameworks",
      "Fitness",
      "Cocktail Mixing",
      "Latte art",
      "Traveling"
    ]
}
